bayarveli/esp32-zigbee-homeassistant-temperature-humidity-monitor/sdkconfig.defaults
# ESP32-H2 Configuration Defaults
CONFIG_IDF_TARGET="esp32h2"

# Flash configuration for ESP32-H2
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_48M=y

# Partition table
CONFIG_PARTITION_TABLE_SINGLE_APP=y

# Log output
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# FreeRTOS - Increase main task stack size to prevent overflow
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# DHT22 default pin (can be changed via menuconfig for ESP32-H2 pinout)
CONFIG_DHT22_GPIO=10